hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_fmc.h
/*
; stm32N657_fmc.
; ==============

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_fmc equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// FMC address definitions
// -----------------------

typedef struct {
	volatile	uint32_t	BCR1;
	volatile	uint32_t	BTR1;
	volatile	uint32_t	BCR2;
	volatile	uint32_t	BTR2;
	volatile	uint32_t	BCR3;
	volatile	uint32_t	BTR3;
	volatile	uint32_t	BCR4;
	volatile	uint32_t	BTR4;
	volatile	uint32_t	CFGR;
	volatile	uint32_t	RESERVED0[23];
	volatile	uint32_t	PCR;
	volatile	uint32_t	SR;
	volatile	uint32_t	PMEM;
	volatile	uint32_t	PATT;
	volatile	uint32_t	HPR;
	volatile	uint32_t	HECCR;
	volatile	uint32_t	RESERVED1[27];
	volatile	uint32_t	BWTR1;
	volatile	uint32_t	RESERVED2;
	volatile	uint32_t	BWTR2;
	volatile	uint32_t	RESERVED3;
	volatile	uint32_t	BWTR3;
	volatile	uint32_t	RESERVED4;
	volatile	uint32_t	BWTR4;
	volatile	uint32_t	RESERVED5[8];
	volatile	uint32_t	SDCR1;
	volatile	uint32_t	SDCR2;
	volatile	uint32_t	SDTR;
	volatile	uint32_t	RESERVED6;
	volatile	uint32_t	SDCMR;
	volatile	uint32_t	SDRTR;
	volatile	uint32_t	SDSR;
	volatile	uint32_t	RESERVED7[9];
	volatile	uint32_t	IER;
	volatile	uint32_t	ISR;
	volatile	uint32_t	ICR;
	volatile	uint32_t	RESERVED8[29];
	volatile	uint32_t	CSQCR;
	volatile	uint32_t	CSQCFGR1;
	volatile	uint32_t	CSQCFGR2;
	volatile	uint32_t	CSQCFGR3;
	volatile	uint32_t	CSQAR1;
	volatile	uint32_t	CSQAR2;
	volatile	uint32_t	RESERVED9[2];
	volatile	uint32_t	CSQIER;
	volatile	uint32_t	CSQISR;
	volatile	uint32_t	CSQICR;
	volatile	uint32_t	RESERVED10;
	volatile	uint32_t	CSQEMSR;
	volatile	uint32_t	RESERVED11[7];
	volatile	uint32_t	BCHIER;
	volatile	uint32_t	BCHISR;
	volatile	uint32_t	BCHICR;
	volatile	uint32_t	RESERVED12;
	volatile	uint32_t	BCHPBR1;
	volatile	uint32_t	BCHPBR2;
	volatile	uint32_t	BCHPBR3;
	volatile	uint32_t	BCHPBR4;
	volatile	uint32_t	RESERVED13[3];
	volatile	uint32_t	BCHDSR0;
	volatile	uint32_t	BCHDSR1;
	volatile	uint32_t	BCHDSR2;
	volatile	uint32_t	BCHDSR3;
	volatile	uint32_t	BCHDSR4;
} FMC_TypeDef;

#if (defined(__cplusplus))
#define	FMC1_NS	reinterpret_cast<FMC_TypeDef *>(0x48024000u)
#define	FMC1_S	reinterpret_cast<FMC_TypeDef *>(0x58024000u)

#else
#define	FMC1_NS	((FMC_TypeDef *)0x48024000u)
#define	FMC1_S	((FMC_TypeDef *)0x58024000u)
#endif

// BCR1 Configuration

#define	FMC_BCR1_NBLSET				(0x3u<<22)
#define	FMC_BCR1_NBLSET_0			(0x1u<<22)
#define	FMC_BCR1_CSCOUNT0			(0x3u<<20)
#define	FMC_BCR1_CSCOUNT0_0			(0x1u<<20)
#define	FMC_BCR1_CBURSTRW			(0x1u<<19)
#define	FMC_BCR1_CPSIZE				(0x7u<<16)
#define	FMC_BCR1_CPSIZE_0			(0x1u<<16)
#define	FMC_BCR1_ASYNCWAIT			(0x1u<<15)
#define	FMC_BCR1_EXTMOD				(0x1u<<14)
#define	FMC_BCR1_WAITEN				(0x1u<<13)
#define	FMC_BCR1_WREN				(0x1u<<12)
#define	FMC_BCR1_WAITCFG			(0x1u<<11)
#define	FMC_BCR1_WAITPOL			(0x1u<<9)
#define	FMC_BCR1_BURSTEN			(0x1u<<8)
#define	FMC_BCR1_FACCEN				(0x1u<<6)
#define	FMC_BCR1_MWID				(0x3u<<4)
#define	FMC_BCR1_MWID_0				(0x1u<<4)
#define	FMC_BCR1_MTYP				(0x3u<<2)
#define	FMC_BCR1_MTYP_0				(0x1u<<2)
#define	FMC_BCR1_MUXEN				(0x1u<<1)
#define	FMC_BCR1_MBKEN				(0x1u<<0)

#define	FMC_BCR1_NBLSET_B_0X0		(0x0u<<22)
#define	FMC_BCR1_NBLSET_B_0X1		(0x1u<<22)
#define	FMC_BCR1_NBLSET_B_0X2		(0x2u<<22)
#define	FMC_BCR1_NBLSET_B_0X3		(0x3u<<22)
#define	FMC_BCR1_CSCOUNT0_B_0X0		(0x0u<<20)
#define	FMC_BCR1_CSCOUNT0_B_0X1		(0x1u<<20)
#define	FMC_BCR1_CSCOUNT0_B_0X2		(0x2u<<20)
#define	FMC_BCR1_CSCOUNT0_B_0X3		(0x3u<<20)
#define	FMC_BCR1_CBURSTRW_B_0X0		(0x0u<<19)
#define	FMC_BCR1_CBURSTRW_B_0X1		(0x1u<<19)
#define	FMC_BCR1_CPSIZE_B_0X0		(0x0u<<16)
#define	FMC_BCR1_CPSIZE_B_0X1		(0x1u<<16)
#define	FMC_BCR1_CPSIZE_B_0X2		(0x2u<<16)
#define	FMC_BCR1_CPSIZE_B_0X3		(0x3u<<16)
#define	FMC_BCR1_CPSIZE_B_0X4		(0x4u<<16)
#define	FMC_BCR1_ASYNCWAIT_B_0X0	(0x0u<<15)
#define	FMC_BCR1_ASYNCWAIT_B_0X1	(0x1u<<15)
#define	FMC_BCR1_EXTMOD_B_0X0		(0x0u<<14)
#define	FMC_BCR1_EXTMOD_B_0X1		(0x1u<<14)
#define	FMC_BCR1_WAITEN_B_0X0		(0x0u<<13)
#define	FMC_BCR1_WAITEN_B_0X1		(0x1u<<13)
#define	FMC_BCR1_WREN_B_0X0			(0x0u<<12)
#define	FMC_BCR1_WREN_B_0X1			(0x1u<<12)
#define	FMC_BCR1_WAITCFG_B_0X0		(0x0u<<11)
#define	FMC_BCR1_WAITCFG_B_0X1		(0x1u<<11)
#define	FMC_BCR1_WAITPOL_B_0X0		(0x0u<<9)
#define	FMC_BCR1_WAITPOL_B_0X1		(0x1u<<9)
#define	FMC_BCR1_BURSTEN_B_0X0		(0x0u<<8)
#define	FMC_BCR1_BURSTEN_B_0X1		(0x1u<<8)
#define	FMC_BCR1_FACCEN_B_0X0		(0x0u<<6)
#define	FMC_BCR1_FACCEN_B_0X1		(0x1u<<6)
#define	FMC_BCR1_MWID_B_0X0			(0x0u<<4)
#define	FMC_BCR1_MWID_B_0X1			(0x1u<<4)
#define	FMC_BCR1_MWID_B_0X2			(0x2u<<4)
#define	FMC_BCR1_MTYP_B_0X0			(0x0u<<2)
#define	FMC_BCR1_MTYP_B_0X1			(0x1u<<2)
#define	FMC_BCR1_MTYP_B_0X2			(0x2u<<2)
#define	FMC_BCR1_MUXEN_B_0X0		(0x0u<<1)
#define	FMC_BCR1_MUXEN_B_0X1		(0x1u<<1)
#define	FMC_BCR1_MBKEN_B_0X0		(0x0u<<0)
#define	FMC_BCR1_MBKEN_B_0X1		(0x1u<<0)

