hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_fmc.h
// BTR1 Configuration

#define	FMC_BTR1_DATAHLD			(0x3u<<30)
#define	FMC_BTR1_DATAHLD_0			(0x1u<<30)
#define	FMC_BTR1_ACCMOD				(0x3u<<28)
#define	FMC_BTR1_ACCMOD_0			(0x1u<<28)
#define	FMC_BTR1_DATLAT				(0xFu<<24)
#define	FMC_BTR1_DATLAT_0			(0x1u<<24)
#define	FMC_BTR1_CLKDIV				(0xFu<<20)
#define	FMC_BTR1_CLKDIV_0			(0x1u<<20)
#define	FMC_BTR1_BUSTURN			(0xFu<<16)
#define	FMC_BTR1_BUSTURN_0			(0x1u<<16)
#define	FMC_BTR1_DATAST				(0xFFu<<8)
#define	FMC_BTR1_DATAST_0			(0x1u<<8)
#define	FMC_BTR1_ADDHLD				(0xFu<<4)
#define	FMC_BTR1_ADDHLD_0			(0x1u<<4)
#define	FMC_BTR1_ADDSET				(0xFu<<0)
#define	FMC_BTR1_ADDSET_0			(0x1u<<0)

#define	FMC_BTR1_DATAHLD_B_0X0		(0x0u<<30)
#define	FMC_BTR1_DATAHLD_B_0X1		(0x1u<<30)
#define	FMC_BTR1_DATAHLD_B_0X2		(0x2u<<30)
#define	FMC_BTR1_DATAHLD_B_0X3		(0x3u<<30)
#define	FMC_BTR1_ACCMOD_B_0X0		(0x0u<<28)
#define	FMC_BTR1_ACCMOD_B_0X1		(0x1u<<28)
#define	FMC_BTR1_ACCMOD_B_0X2		(0x2u<<28)
#define	FMC_BTR1_ACCMOD_B_0X3		(0x3u<<28)
#define	FMC_BTR1_DATLAT_B_0X0		(0x0u<<24)
#define	FMC_BTR1_DATLAT_B_0XF		(0xFu<<24)
#define	FMC_BTR1_CLKDIV_B_0X0		(0x0u<<20)
#define	FMC_BTR1_CLKDIV_B_0X1		(0x1u<<20)
#define	FMC_BTR1_CLKDIV_B_0X2		(0x2u<<20)
#define	FMC_BTR1_CLKDIV_B_0XF		(0xFu<<20)
#define	FMC_BTR1_BUSTURN_B_0X0		(0x0u<<16)
#define	FMC_BTR1_BUSTURN_B_0XF		(0xFu<<16)
#define	FMC_BTR1_DATAST_B_0X1		(0x1u<<8)
#define	FMC_BTR1_DATAST_B_0X2		(0x2u<<8)
#define	FMC_BTR1_DATAST_B_0XFF		(0xFFu<<8)
#define	FMC_BTR1_ADDHLD_B_0X1		(0x1u<<4)
#define	FMC_BTR1_ADDHLD_B_0X2		(0x2u<<4)
#define	FMC_BTR1_ADDHLD_B_0XF		(0xFu<<4)
#define	FMC_BTR1_ADDSET_B_0X0		(0x0u<<0)
#define	FMC_BTR1_ADDSET_B_0XF		(0xFu<<0)

// BCR2 Configuration

#define	FMC_BCR2_NBLSET				(0x3u<<22)
#define	FMC_BCR2_NBLSET_0			(0x1u<<22)
#define	FMC_BCR2_CSCOUNT1			(0x1u<<21)
#define	FMC_BCR2_CSCOUNT0			(0x1u<<20)
#define	FMC_BCR2_CBURSTRW			(0x1u<<19)
#define	FMC_BCR2_CPSIZE				(0x7u<<16)
#define	FMC_BCR2_CPSIZE_0			(0x1u<<16)
#define	FMC_BCR2_ASYNCWAIT			(0x1u<<15)
#define	FMC_BCR2_EXTMOD				(0x1u<<14)
#define	FMC_BCR2_WAITEN				(0x1u<<13)
#define	FMC_BCR2_WREN				(0x1u<<12)
#define	FMC_BCR2_WAITCFG			(0x1u<<11)
#define	FMC_BCR2_WAITPOL			(0x1u<<9)
#define	FMC_BCR2_BURSTEN			(0x1u<<8)
#define	FMC_BCR2_FACCEN				(0x1u<<6)
#define	FMC_BCR2_MWID				(0x3u<<4)
#define	FMC_BCR2_MWID_0				(0x1u<<4)
#define	FMC_BCR2_MTYP				(0x3u<<2)
#define	FMC_BCR2_MTYP_0				(0x1u<<2)
#define	FMC_BCR2_MUXEN				(0x1u<<1)
#define	FMC_BCR2_MBKEN				(0x1u<<0)

#define	FMC_BCR2_NBLSET_B_0X0		(0x0u<<22)
#define	FMC_BCR2_NBLSET_B_0X1		(0x1u<<22)
#define	FMC_BCR2_NBLSET_B_0X2		(0x2u<<22)
#define	FMC_BCR2_NBLSET_B_0X3		(0x3u<<22)
#define	FMC_BCR2_CSCOUNT1_B_0X0		(0x0u<<21)
#define	FMC_BCR2_CSCOUNT1_B_0X1		(0x1u<<21)
#define	FMC_BCR2_CSCOUNT0_B_0X0		(0x0u<<20)
#define	FMC_BCR2_CSCOUNT0_B_0X1		(0x1u<<20)
#define	FMC_BCR2_CBURSTRW_B_0X0		(0x0u<<19)
#define	FMC_BCR2_CBURSTRW_B_0X1		(0x1u<<19)
#define	FMC_BCR2_CPSIZE_B_0X0		(0x0u<<16)
#define	FMC_BCR2_CPSIZE_B_0X1		(0x1u<<16)
#define	FMC_BCR2_CPSIZE_B_0X2		(0x2u<<16)
#define	FMC_BCR2_CPSIZE_B_0X3		(0x3u<<16)
#define	FMC_BCR2_CPSIZE_B_0X4		(0x4u<<16)
#define	FMC_BCR2_ASYNCWAIT_B_0X0	(0x0u<<15)
#define	FMC_BCR2_ASYNCWAIT_B_0X1	(0x1u<<15)
#define	FMC_BCR2_EXTMOD_B_0X0		(0x0u<<14)
#define	FMC_BCR2_EXTMOD_B_0X1		(0x1u<<14)
#define	FMC_BCR2_WAITEN_B_0X0		(0x0u<<13)
#define	FMC_BCR2_WAITEN_B_0X1		(0x1u<<13)
#define	FMC_BCR2_WREN_B_0X0			(0x0u<<12)
#define	FMC_BCR2_WREN_B_0X1			(0x1u<<12)
#define	FMC_BCR2_WAITCFG_B_0X0		(0x0u<<11)
#define	FMC_BCR2_WAITCFG_B_0X1		(0x1u<<11)
#define	FMC_BCR2_WAITPOL_B_0X0		(0x0u<<9)
#define	FMC_BCR2_WAITPOL_B_0X1		(0x1u<<9)
#define	FMC_BCR2_BURSTEN_B_0X0		(0x0u<<8)
#define	FMC_BCR2_BURSTEN_B_0X1		(0x1u<<8)
#define	FMC_BCR2_FACCEN_B_0X0		(0x0u<<6)
#define	FMC_BCR2_FACCEN_B_0X1		(0x1u<<6)
#define	FMC_BCR2_MWID_B_0X0			(0x0u<<4)
#define	FMC_BCR2_MWID_B_0X1			(0x1u<<4)
#define	FMC_BCR2_MWID_B_0X2			(0x2u<<4)
#define	FMC_BCR2_MTYP_B_0X0			(0x0u<<2)
#define	FMC_BCR2_MTYP_B_0X1			(0x1u<<2)
#define	FMC_BCR2_MTYP_B_0X2			(0x2u<<2)
#define	FMC_BCR2_MUXEN_B_0X0		(0x0u<<1)
#define	FMC_BCR2_MUXEN_B_0X1		(0x1u<<1)
#define	FMC_BCR2_MBKEN_B_0X0		(0x0u<<0)
#define	FMC_BCR2_MBKEN_B_0X1		(0x1u<<0)

// BTR2 Configuration

#define	FMC_BTR2_DATAHLD			(0x3u<<30)
#define	FMC_BTR2_DATAHLD_0			(0x1u<<30)
#define	FMC_BTR2_ACCMOD				(0x3u<<28)
#define	FMC_BTR2_ACCMOD_0			(0x1u<<28)
#define	FMC_BTR2_DATLAT				(0xFu<<24)
#define	FMC_BTR2_DATLAT_0			(0x1u<<24)
#define	FMC_BTR2_CLKDIV				(0xFu<<20)
#define	FMC_BTR2_CLKDIV_0			(0x1u<<20)
#define	FMC_BTR2_BUSTURN			(0xFu<<16)
#define	FMC_BTR2_BUSTURN_0			(0x1u<<16)
#define	FMC_BTR2_DATAST				(0xFFu<<8)
#define	FMC_BTR2_DATAST_0			(0x1u<<8)
#define	FMC_BTR2_ADDHLD				(0xFu<<4)
#define	FMC_BTR2_ADDHLD_0			(0x1u<<4)
#define	FMC_BTR2_ADDSET				(0xFu<<0)
#define	FMC_BTR2_ADDSET_0			(0x1u<<0)

#define	FMC_BTR2_DATAHLD_B_0X0		(0x0u<<30)
#define	FMC_BTR2_DATAHLD_B_0X1		(0x1u<<30)
#define	FMC_BTR2_DATAHLD_B_0X2		(0x2u<<30)
#define	FMC_BTR2_DATAHLD_B_0X3		(0x3u<<30)
#define	FMC_BTR2_ACCMOD_B_0X0		(0x0u<<28)
#define	FMC_BTR2_ACCMOD_B_0X1		(0x1u<<28)
#define	FMC_BTR2_ACCMOD_B_0X2		(0x2u<<28)
#define	FMC_BTR2_ACCMOD_B_0X3		(0x3u<<28)
#define	FMC_BTR2_DATLAT_B_0X0		(0x0u<<24)
#define	FMC_BTR2_DATLAT_B_0XF		(0xFu<<24)
#define	FMC_BTR2_CLKDIV_B_0X0		(0x0u<<20)
#define	FMC_BTR2_CLKDIV_B_0X1		(0x1u<<20)
#define	FMC_BTR2_CLKDIV_B_0X2		(0x2u<<20)
#define	FMC_BTR2_CLKDIV_B_0XF		(0xFu<<20)
#define	FMC_BTR2_BUSTURN_B_0X0		(0x0u<<16)
#define	FMC_BTR2_BUSTURN_B_0XF		(0xFu<<16)
#define	FMC_BTR2_DATAST_B_0X1		(0x1u<<8)
#define	FMC_BTR2_DATAST_B_0X2		(0x2u<<8)
#define	FMC_BTR2_DATAST_B_0XFF		(0xFFu<<8)
#define	FMC_BTR2_ADDHLD_B_0X1		(0x1u<<4)
#define	FMC_BTR2_ADDHLD_B_0X2		(0x2u<<4)
#define	FMC_BTR2_ADDHLD_B_0XF		(0xFu<<4)
#define	FMC_BTR2_ADDSET_B_0X0		(0x0u<<0)
#define	FMC_BTR2_ADDSET_B_0XF		(0xFu<<0)

// BCR3 Configuration

#define	FMC_BCR3_NBLSET				(0x3u<<22)
#define	FMC_BCR3_NBLSET_0			(0x1u<<22)
#define	FMC_BCR3_CSCOUNT1			(0x1u<<21)
#define	FMC_BCR3_CSCOUNT0			(0x1u<<20)
#define	FMC_BCR3_CBURSTRW			(0x1u<<19)
#define	FMC_BCR3_CPSIZE				(0x7u<<16)
#define	FMC_BCR3_CPSIZE_0			(0x1u<<16)
#define	FMC_BCR3_ASYNCWAIT			(0x1u<<15)
#define	FMC_BCR3_EXTMOD				(0x1u<<14)
#define	FMC_BCR3_WAITEN				(0x1u<<13)
#define	FMC_BCR3_WREN				(0x1u<<12)
#define	FMC_BCR3_WAITCFG			(0x1u<<11)
#define	FMC_BCR3_WAITPOL			(0x1u<<9)
#define	FMC_BCR3_BURSTEN			(0x1u<<8)
#define	FMC_BCR3_FACCEN				(0x1u<<6)
#define	FMC_BCR3_MWID				(0x3u<<4)
#define	FMC_BCR3_MWID_0				(0x1u<<4)
#define	FMC_BCR3_MTYP				(0x3u<<2)
#define	FMC_BCR3_MTYP_0				(0x1u<<2)
#define	FMC_BCR3_MUXEN				(0x1u<<1)
#define	FMC_BCR3_MBKEN				(0x1u<<0)

#define	FMC_BCR3_NBLSET_B_0X0		(0x0u<<22)
#define	FMC_BCR3_NBLSET_B_0X1		(0x1u<<22)
#define	FMC_BCR3_NBLSET_B_0X2		(0x2u<<22)
#define	FMC_BCR3_NBLSET_B_0X3		(0x3u<<22)
#define	FMC_BCR3_CSCOUNT1_B_0X0		(0x0u<<21)
#define	FMC_BCR3_CSCOUNT1_B_0X1		(0x1u<<21)
#define	FMC_BCR3_CSCOUNT0_B_0X0		(0x0u<<20)
#define	FMC_BCR3_CSCOUNT0_B_0X1		(0x1u<<20)
#define	FMC_BCR3_CBURSTRW_B_0X0		(0x0u<<19)
#define	FMC_BCR3_CBURSTRW_B_0X1		(0x1u<<19)
#define	FMC_BCR3_CPSIZE_B_0X0		(0x0u<<16)
#define	FMC_BCR3_CPSIZE_B_0X1		(0x1u<<16)
#define	FMC_BCR3_CPSIZE_B_0X2		(0x2u<<16)
#define	FMC_BCR3_CPSIZE_B_0X3		(0x3u<<16)
#define	FMC_BCR3_CPSIZE_B_0X4		(0x4u<<16)
#define	FMC_BCR3_ASYNCWAIT_B_0X0	(0x0u<<15)
#define	FMC_BCR3_ASYNCWAIT_B_0X1	(0x1u<<15)
#define	FMC_BCR3_EXTMOD_B_0X0		(0x0u<<14)
#define	FMC_BCR3_EXTMOD_B_0X1		(0x1u<<14)
#define	FMC_BCR3_WAITEN_B_0X0		(0x0u<<13)
#define	FMC_BCR3_WAITEN_B_0X1		(0x1u<<13)
#define	FMC_BCR3_WREN_B_0X0			(0x0u<<12)
#define	FMC_BCR3_WREN_B_0X1			(0x1u<<12)
#define	FMC_BCR3_WAITCFG_B_0X0		(0x0u<<11)
#define	FMC_BCR3_WAITCFG_B_0X1		(0x1u<<11)
#define	FMC_BCR3_WAITPOL_B_0X0		(0x0u<<9)
#define	FMC_BCR3_WAITPOL_B_0X1		(0x1u<<9)
#define	FMC_BCR3_BURSTEN_B_0X0		(0x0u<<8)
#define	FMC_BCR3_BURSTEN_B_0X1		(0x1u<<8)
#define	FMC_BCR3_FACCEN_B_0X0		(0x0u<<6)
#define	FMC_BCR3_FACCEN_B_0X1		(0x1u<<6)
#define	FMC_BCR3_MWID_B_0X0			(0x0u<<4)
#define	FMC_BCR3_MWID_B_0X1			(0x1u<<4)
#define	FMC_BCR3_MWID_B_0X2			(0x2u<<4)
#define	FMC_BCR3_MTYP_B_0X0			(0x0u<<2)
#define	FMC_BCR3_MTYP_B_0X1			(0x1u<<2)
#define	FMC_BCR3_MTYP_B_0X2			(0x2u<<2)
#define	FMC_BCR3_MUXEN_B_0X0		(0x0u<<1)
#define	FMC_BCR3_MUXEN_B_0X1		(0x1u<<1)
#define	FMC_BCR3_MBKEN_B_0X0		(0x0u<<0)
#define	FMC_BCR3_MBKEN_B_0X1		(0x1u<<0)

// BTR3 Configuration

#define	FMC_BTR3_DATAHLD			(0x3u<<30)
#define	FMC_BTR3_DATAHLD_0			(0x1u<<30)
#define	FMC_BTR3_ACCMOD				(0x3u<<28)
#define	FMC_BTR3_ACCMOD_0			(0x1u<<28)
#define	FMC_BTR3_DATLAT				(0xFu<<24)
#define	FMC_BTR3_DATLAT_0			(0x1u<<24)
#define	FMC_BTR3_CLKDIV				(0xFu<<20)
#define	FMC_BTR3_CLKDIV_0			(0x1u<<20)
#define	FMC_BTR3_BUSTURN			(0xFu<<16)
#define	FMC_BTR3_BUSTURN_0			(0x1u<<16)
#define	FMC_BTR3_DATAST				(0xFFu<<8)
#define	FMC_BTR3_DATAST_0			(0x1u<<8)
#define	FMC_BTR3_ADDHLD				(0xFu<<4)
#define	FMC_BTR3_ADDHLD_0			(0x1u<<4)
#define	FMC_BTR3_ADDSET				(0xFu<<0)
#define	FMC_BTR3_ADDSET_0			(0x1u<<0)

#define	FMC_BTR3_DATAHLD_B_0X0		(0x0u<<30)
#define	FMC_BTR3_DATAHLD_B_0X1		(0x1u<<30)
#define	FMC_BTR3_DATAHLD_B_0X2		(0x2u<<30)
#define	FMC_BTR3_DATAHLD_B_0X3		(0x3u<<30)
#define	FMC_BTR3_ACCMOD_B_0X0		(0x0u<<28)
#define	FMC_BTR3_ACCMOD_B_0X1		(0x1u<<28)
#define	FMC_BTR3_ACCMOD_B_0X2		(0x2u<<28)
#define	FMC_BTR3_ACCMOD_B_0X3		(0x3u<<28)
#define	FMC_BTR3_DATLAT_B_0X0		(0x0u<<24)
#define	FMC_BTR3_DATLAT_B_0XF		(0xFu<<24)
#define	FMC_BTR3_CLKDIV_B_0X0		(0x0u<<20)
#define	FMC_BTR3_CLKDIV_B_0X1		(0x1u<<20)
#define	FMC_BTR3_CLKDIV_B_0X2		(0x2u<<20)
#define	FMC_BTR3_CLKDIV_B_0XF		(0xFu<<20)
#define	FMC_BTR3_BUSTURN_B_0X0		(0x0u<<16)
#define	FMC_BTR3_BUSTURN_B_0XF		(0xFu<<16)
#define	FMC_BTR3_DATAST_B_0X1		(0x1u<<8)
#define	FMC_BTR3_DATAST_B_0X2		(0x2u<<8)
#define	FMC_BTR3_DATAST_B_0XFF		(0xFFu<<8)
#define	FMC_BTR3_ADDHLD_B_0X1		(0x1u<<4)
#define	FMC_BTR3_ADDHLD_B_0X2		(0x2u<<4)
#define	FMC_BTR3_ADDHLD_B_0XF		(0xFu<<4)
#define	FMC_BTR3_ADDSET_B_0X0		(0x0u<<0)
#define	FMC_BTR3_ADDSET_B_0XF		(0xFu<<0)

// BCR4 Configuration

#define	FMC_BCR4_NBLSET				(0x3u<<22)
#define	FMC_BCR4_NBLSET_0			(0x1u<<22)
#define	FMC_BCR4_CSCOUNT1			(0x1u<<21)
#define	FMC_BCR4_CSCOUNT0			(0x1u<<20)
#define	FMC_BCR4_CBURSTRW			(0x1u<<19)
#define	FMC_BCR4_CPSIZE				(0x7u<<16)
#define	FMC_BCR4_CPSIZE_0			(0x1u<<16)
#define	FMC_BCR4_ASYNCWAIT			(0x1u<<15)
#define	FMC_BCR4_EXTMOD				(0x1u<<14)
#define	FMC_BCR4_WAITEN				(0x1u<<13)
#define	FMC_BCR4_WREN				(0x1u<<12)
#define	FMC_BCR4_WAITCFG			(0x1u<<11)
#define	FMC_BCR4_WAITPOL			(0x1u<<9)
#define	FMC_BCR4_BURSTEN			(0x1u<<8)
#define	FMC_BCR4_FACCEN				(0x1u<<6)
#define	FMC_BCR4_MWID				(0x3u<<4)
#define	FMC_BCR4_MWID_0				(0x1u<<4)
#define	FMC_BCR4_MTYP				(0x3u<<2)
#define	FMC_BCR4_MTYP_0				(0x1u<<2)
#define	FMC_BCR4_MUXEN				(0x1u<<1)
#define	FMC_BCR4_MBKEN				(0x1u<<0)

#define	FMC_BCR4_NBLSET_B_0X0		(0x0u<<22)
#define	FMC_BCR4_NBLSET_B_0X1		(0x1u<<22)
#define	FMC_BCR4_NBLSET_B_0X2		(0x2u<<22)
#define	FMC_BCR4_NBLSET_B_0X3		(0x3u<<22)
#define	FMC_BCR4_CSCOUNT1_B_0X0		(0x0u<<21)
#define	FMC_BCR4_CSCOUNT1_B_0X1		(0x1u<<21)
#define	FMC_BCR4_CSCOUNT0_B_0X0		(0x0u<<20)
#define	FMC_BCR4_CSCOUNT0_B_0X1		(0x1u<<20)
#define	FMC_BCR4_CBURSTRW_B_0X0		(0x0u<<19)
#define	FMC_BCR4_CBURSTRW_B_0X1		(0x1u<<19)
#define	FMC_BCR4_CPSIZE_B_0X0		(0x0u<<16)
#define	FMC_BCR4_CPSIZE_B_0X1		(0x1u<<16)
#define	FMC_BCR4_CPSIZE_B_0X2		(0x2u<<16)
#define	FMC_BCR4_CPSIZE_B_0X3		(0x3u<<16)
#define	FMC_BCR4_CPSIZE_B_0X4		(0x4u<<16)
#define	FMC_BCR4_ASYNCWAIT_B_0X0	(0x0u<<15)
#define	FMC_BCR4_ASYNCWAIT_B_0X1	(0x1u<<15)
#define	FMC_BCR4_EXTMOD_B_0X0		(0x0u<<14)
#define	FMC_BCR4_EXTMOD_B_0X1		(0x1u<<14)
#define	FMC_BCR4_WAITEN_B_0X0		(0x0u<<13)
#define	FMC_BCR4_WAITEN_B_0X1		(0x1u<<13)
#define	FMC_BCR4_WREN_B_0X0			(0x0u<<12)
#define	FMC_BCR4_WREN_B_0X1			(0x1u<<12)
#define	FMC_BCR4_WAITCFG_B_0X0		(0x0u<<11)
#define	FMC_BCR4_WAITCFG_B_0X1		(0x1u<<11)
#define	FMC_BCR4_WAITPOL_B_0X0		(0x0u<<9)
#define	FMC_BCR4_WAITPOL_B_0X1		(0x1u<<9)
#define	FMC_BCR4_BURSTEN_B_0X0		(0x0u<<8)
#define	FMC_BCR4_BURSTEN_B_0X1		(0x1u<<8)
#define	FMC_BCR4_FACCEN_B_0X0		(0x0u<<6)
#define	FMC_BCR4_FACCEN_B_0X1		(0x1u<<6)
#define	FMC_BCR4_MWID_B_0X0			(0x0u<<4)
#define	FMC_BCR4_MWID_B_0X1			(0x1u<<4)
#define	FMC_BCR4_MWID_B_0X2			(0x2u<<4)
#define	FMC_BCR4_MTYP_B_0X0			(0x0u<<2)
#define	FMC_BCR4_MTYP_B_0X1			(0x1u<<2)
#define	FMC_BCR4_MTYP_B_0X2			(0x2u<<2)
#define	FMC_BCR4_MUXEN_B_0X0		(0x0u<<1)
#define	FMC_BCR4_MUXEN_B_0X1		(0x1u<<1)
#define	FMC_BCR4_MBKEN_B_0X0		(0x0u<<0)
#define	FMC_BCR4_MBKEN_B_0X1		(0x1u<<0)

// BTR4 Configuration

#define	FMC_BTR4_DATAHLD			(0x3u<<30)
#define	FMC_BTR4_DATAHLD_0			(0x1u<<30)
#define	FMC_BTR4_ACCMOD				(0x3u<<28)
#define	FMC_BTR4_ACCMOD_0			(0x1u<<28)
#define	FMC_BTR4_DATLAT				(0xFu<<24)
#define	FMC_BTR4_DATLAT_0			(0x1u<<24)
#define	FMC_BTR4_CLKDIV				(0xFu<<20)
#define	FMC_BTR4_CLKDIV_0			(0x1u<<20)
#define	FMC_BTR4_BUSTURN			(0xFu<<16)
#define	FMC_BTR4_BUSTURN_0			(0x1u<<16)
#define	FMC_BTR4_DATAST				(0xFFu<<8)
#define	FMC_BTR4_DATAST_0			(0x1u<<8)
#define	FMC_BTR4_ADDHLD				(0xFu<<4)
#define	FMC_BTR4_ADDHLD_0			(0x1u<<4)
#define	FMC_BTR4_ADDSET				(0xFu<<0)
#define	FMC_BTR4_ADDSET_0			(0x1u<<0)

