hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_fmc.h
#define	FMC_BTR4_DATAHLD_B_0X0		(0x0u<<30)
#define	FMC_BTR4_DATAHLD_B_0X1		(0x1u<<30)
#define	FMC_BTR4_DATAHLD_B_0X2		(0x2u<<30)
#define	FMC_BTR4_DATAHLD_B_0X3		(0x3u<<30)
#define	FMC_BTR4_ACCMOD_B_0X0		(0x0u<<28)
#define	FMC_BTR4_ACCMOD_B_0X1		(0x1u<<28)
#define	FMC_BTR4_ACCMOD_B_0X2		(0x2u<<28)
#define	FMC_BTR4_ACCMOD_B_0X3		(0x3u<<28)
#define	FMC_BTR4_DATLAT_B_0X0		(0x0u<<24)
#define	FMC_BTR4_DATLAT_B_0XF		(0xFu<<24)
#define	FMC_BTR4_CLKDIV_B_0X0		(0x0u<<20)
#define	FMC_BTR4_CLKDIV_B_0X1		(0x1u<<20)
#define	FMC_BTR4_CLKDIV_B_0X2		(0x2u<<20)
#define	FMC_BTR4_CLKDIV_B_0XF		(0xFu<<20)
#define	FMC_BTR4_BUSTURN_B_0X0		(0x0u<<16)
#define	FMC_BTR4_BUSTURN_B_0XF		(0xFu<<16)
#define	FMC_BTR4_DATAST_B_0X1		(0x1u<<8)
#define	FMC_BTR4_DATAST_B_0X2		(0x2u<<8)
#define	FMC_BTR4_DATAST_B_0XFF		(0xFFu<<8)
#define	FMC_BTR4_ADDHLD_B_0X1		(0x1u<<4)
#define	FMC_BTR4_ADDHLD_B_0X2		(0x2u<<4)
#define	FMC_BTR4_ADDHLD_B_0XF		(0xFu<<4)
#define	FMC_BTR4_ADDSET_B_0X0		(0x0u<<0)
#define	FMC_BTR4_ADDSET_B_0XF		(0xFu<<0)

// CFGR Configuration

#define	FMC_CFGR_FMCEN				(0x1u<<31)
#define	FMC_CFGR_BMAP1				(0x1u<<25)
#define	FMC_CFGR_BMAP0				(0x1u<<24)
#define	FMC_CFGR_CCLKEN				(0x1u<<20)
#define	FMC_CFGR_CLKDIV				(0xFu<<16)
#define	FMC_CFGR_CLKDIV_0			(0x1u<<16)

#define	FMC_CFGR_FMCEN_B_0X0		(0x0u<<31)
#define	FMC_CFGR_FMCEN_B_0X1		(0x1u<<31)
#define	FMC_CFGR_BMAP1_B_0X0		(0x0u<<25)
#define	FMC_CFGR_BMAP1_B_0X1		(0x1u<<25)
#define	FMC_CFGR_BMAP0_B_0X0		(0x0u<<24)
#define	FMC_CFGR_BMAP0_B_0X1		(0x1u<<24)
#define	FMC_CFGR_CCLKEN_B_0X0		(0x0u<<20)
#define	FMC_CFGR_CCLKEN_B_0X1		(0x1u<<20)
#define	FMC_CFGR_CLKDIV_B_0X0		(0x0u<<16)
#define	FMC_CFGR_CLKDIV_B_0X1		(0x1u<<16)
#define	FMC_CFGR_CLKDIV_B_0X2		(0x2u<<16)
#define	FMC_CFGR_CLKDIV_B_0XF		(0xFu<<16)

// PCR Configuration

#define	FMC_PCR_WEN					(0x1u<<25)
#define	FMC_PCR_BCHECC				(0x1u<<24)
#define	FMC_PCR_ECCSS				(0x7u<<17)
#define	FMC_PCR_ECCSS_0				(0x1u<<17)
#define	FMC_PCR_TAR					(0xFu<<13)
#define	FMC_PCR_TAR_0				(0x1u<<13)
#define	FMC_PCR_TCLR				(0xFu<<9)
#define	FMC_PCR_TCLR_0				(0x1u<<9)
#define	FMC_PCR_ECCALG				(0x1u<<8)
#define	FMC_PCR_ECCEN				(0x1u<<6)
#define	FMC_PCR_PWID				(0x3u<<4)
#define	FMC_PCR_PWID_0				(0x1u<<4)
#define	FMC_PCR_PBKEN				(0x1u<<2)
#define	FMC_PCR_PWAITEN				(0x1u<<1)

#define	FMC_PCR_WEN_B_0X0			(0x0u<<25)
#define	FMC_PCR_WEN_B_0X1			(0x1u<<25)
#define	FMC_PCR_BCHECC_B_0X0		(0x0u<<24)
#define	FMC_PCR_BCHECC_B_0X1		(0x1u<<24)
#define	FMC_PCR_ECCSS_B_0X0			(0x0u<<17)
#define	FMC_PCR_ECCSS_B_0X1			(0x1u<<17)
#define	FMC_PCR_ECCSS_B_0X2			(0x2u<<17)
#define	FMC_PCR_ECCSS_B_0X3			(0x3u<<17)
#define	FMC_PCR_ECCSS_B_0X4			(0x4u<<17)
#define	FMC_PCR_TAR_B_0X0			(0x0u<<13)
#define	FMC_PCR_TAR_B_0XF			(0xFu<<13)
#define	FMC_PCR_TCLR_B_0X0			(0x0u<<9)
#define	FMC_PCR_TCLR_B_0XF			(0xFu<<9)
#define	FMC_PCR_ECCALG_B_0X0		(0x0u<<8)
#define	FMC_PCR_ECCALG_B_0X1		(0x1u<<8)
#define	FMC_PCR_ECCEN_B_0X0			(0x0u<<6)
#define	FMC_PCR_ECCEN_B_0X1			(0x1u<<6)
#define	FMC_PCR_PWID_B_0X0			(0x0u<<4)
#define	FMC_PCR_PWID_B_0X1			(0x1u<<4)
#define	FMC_PCR_PBKEN_B_0X0			(0x0u<<2)
#define	FMC_PCR_PBKEN_B_0X1			(0x1u<<2)
#define	FMC_PCR_PWAITEN_B_0X0		(0x0u<<1)
#define	FMC_PCR_PWAITEN_B_0X1		(0x1u<<1)

// SR Configuration

#define	FMC_SR_NWRF					(0x1u<<6)
#define	FMC_SR_PEF					(0x1u<<4)
#define	FMC_SR_ISOST				(0x3u<<0)
#define	FMC_SR_ISOST_0				(0x1u<<0)

#define	FMC_SR_NWRF_B_0X0			(0x0u<<6)
#define	FMC_SR_NWRF_B_0X1			(0x1u<<6)
#define	FMC_SR_ISOST_B_0X0			(0x0u<<0)
#define	FMC_SR_ISOST_B_0X1			(0x1u<<0)
#define	FMC_SR_ISOST_B_0X2			(0x2u<<0)
#define	FMC_SR_ISOST_B_0X3			(0x3u<<0)

// PMEM Configuration

#define	FMC_PMEM_MEMHIZ				(0xFFu<<24)
#define	FMC_PMEM_MEMHIZ_0			(0x1u<<24)
#define	FMC_PMEM_MEMHOLD			(0xFFu<<16)
#define	FMC_PMEM_MEMHOLD_0			(0x1u<<16)
#define	FMC_PMEM_MEMWAIT			(0xFFu<<8)
#define	FMC_PMEM_MEMWAIT_0			(0x1u<<8)
#define	FMC_PMEM_MEMSET				(0xFFu<<0)
#define	FMC_PMEM_MEMSET_0			(0x1u<<0)

#define	FMC_PMEM_MEMHIZ_B_0X0		(0x0u<<24)
#define	FMC_PMEM_MEMHIZ_B_0X1		(0x1u<<24)
#define	FMC_PMEM_MEMHIZ_B_0XFF		(0xFFu<<24)
#define	FMC_PMEM_MEMHOLD_B_0X0		(0x0u<<16)
#define	FMC_PMEM_MEMHOLD_B_0X1		(0x1u<<16)
#define	FMC_PMEM_MEMHOLD_B_0XFF		(0xFFu<<16)
#define	FMC_PMEM_MEMWAIT_B_0X0		(0x0u<<8)
#define	FMC_PMEM_MEMWAIT_B_0X1		(0x1u<<8)
#define	FMC_PMEM_MEMWAIT_B_0XFF		(0xFFu<<8)
#define	FMC_PMEM_MEMSET_B_0X0		(0x0u<<0)
#define	FMC_PMEM_MEMSET_B_0X1		(0x1u<<0)
#define	FMC_PMEM_MEMSET_B_0XFF		(0xFFu<<0)

// PATT Configuration

#define	FMC_PATT_ATTHIZ				(0xFFu<<24)
#define	FMC_PATT_ATTHIZ_0			(0x1u<<24)
#define	FMC_PATT_ATTHOLD			(0xFFu<<16)
#define	FMC_PATT_ATTHOLD_0			(0x1u<<16)
#define	FMC_PATT_ATTWAIT			(0xFFu<<8)
#define	FMC_PATT_ATTWAIT_0			(0x1u<<8)
#define	FMC_PATT_ATTSET				(0xFFu<<0)
#define	FMC_PATT_ATTSET_0			(0x1u<<0)

#define	FMC_PATT_ATTHIZ_B_0X0		(0x0u<<24)
#define	FMC_PATT_ATTHIZ_B_0X1		(0x1u<<24)
#define	FMC_PATT_ATTHIZ_B_0XFF		(0xFFu<<24)
#define	FMC_PATT_ATTHOLD_B_0X0		(0x0u<<16)
#define	FMC_PATT_ATTHOLD_B_0X1		(0x1u<<16)
#define	FMC_PATT_ATTHOLD_B_0XFF		(0xFFu<<16)
#define	FMC_PATT_ATTWAIT_B_0X0		(0x0u<<8)
#define	FMC_PATT_ATTWAIT_B_0X1		(0x1u<<8)
#define	FMC_PATT_ATTWAIT_B_0XFF		(0xFFu<<8)
#define	FMC_PATT_ATTSET_B_0X0		(0x0u<<0)
#define	FMC_PATT_ATTSET_B_0X1		(0x1u<<0)
#define	FMC_PATT_ATTSET_B_0XFF		(0xFFu<<0)

// HPR Configuration

#define	FMC_HPR_HPR					(0xFFFFFFFFu<<0)
#define	FMC_HPR_HPR_0				(0x1u<<0)

// HECCR Configuration

#define	FMC_HECCR_HECC				(0xFFFFFFFFu<<0)
#define	FMC_HECCR_HECC_0			(0x1u<<0)

// BWTR1 Configuration

#define	FMC_BWTR1_DATAHLD			(0x3u<<30)
#define	FMC_BWTR1_DATAHLD_0			(0x1u<<30)
#define	FMC_BWTR1_ACCMOD			(0x3u<<28)
#define	FMC_BWTR1_ACCMOD_0			(0x1u<<28)
#define	FMC_BWTR1_BUSTURN			(0xFu<<16)
#define	FMC_BWTR1_BUSTURN_0			(0x1u<<16)
#define	FMC_BWTR1_DATAST			(0xFFu<<8)
#define	FMC_BWTR1_DATAST_0			(0x1u<<8)
#define	FMC_BWTR1_ADDHLD			(0xFu<<4)
#define	FMC_BWTR1_ADDHLD_0			(0x1u<<4)
#define	FMC_BWTR1_ADDSET			(0xFu<<0)
#define	FMC_BWTR1_ADDSET_0			(0x1u<<0)

#define	FMC_BWTR1_DATAHLD_B_0X0		(0x0u<<30)
#define	FMC_BWTR1_DATAHLD_B_0X1		(0x1u<<30)
#define	FMC_BWTR1_DATAHLD_B_0X2		(0x2u<<30)
#define	FMC_BWTR1_DATAHLD_B_0X3		(0x3u<<30)
#define	FMC_BWTR1_ACCMOD_B_0X0		(0x0u<<28)
#define	FMC_BWTR1_ACCMOD_B_0X1		(0x1u<<28)
#define	FMC_BWTR1_ACCMOD_B_0X2		(0x2u<<28)
#define	FMC_BWTR1_ACCMOD_B_0X3		(0x3u<<28)
#define	FMC_BWTR1_BUSTURN_B_0X0		(0x0u<<16)
#define	FMC_BWTR1_BUSTURN_B_0XF		(0xFu<<16)
#define	FMC_BWTR1_DATAST_B_0X1		(0x1u<<8)
#define	FMC_BWTR1_DATAST_B_0X2		(0x2u<<8)
#define	FMC_BWTR1_DATAST_B_0XFF		(0xFFu<<8)
#define	FMC_BWTR1_ADDHLD_B_0X1		(0x1u<<4)
#define	FMC_BWTR1_ADDHLD_B_0X2		(0x2u<<4)
#define	FMC_BWTR1_ADDHLD_B_0XF		(0xFu<<4)
#define	FMC_BWTR1_ADDSET_B_0X0		(0x0u<<0)
#define	FMC_BWTR1_ADDSET_B_0XF		(0xFu<<0)

// BWTR2 Configuration

